IDENTIFICATION DIVISION.
PROGRAM-ID. BANCO2.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 OPCAO PIC 9 VALUE 0.
01 SALDO PIC 9(5)V99 VALUE 0.
01 VALOR PIC 9(5)V99 VALUE 0.
01 CONTA PIC 9(4).
01 NOME PIC A(30).

PROCEDURE DIVISION.

INICIO.
    DISPLAY "DIGITE O NUMERO DA CONTA:".
    ACCEPT CONTA.
    DISPLAY "DIGITE O NOME DO CLIENTE:".
    ACCEPT NOME.

    PERFORM MENU-PROGRAM UNTIL OPCAO = 5.

    DISPLAY "ENCERRANDO SISTEMA...".
    STOP RUN.

MENU-PROGRAM.
    DISPLAY " ".
    DISPLAY "1 - VER SALDO".
    DISPLAY "2 - DEPOSITAR".
    DISPLAY "3 - SACAR".
    DISPLAY "4 - VER DADOS DA CONTA".
    DISPLAY "5 - SAIR".
    ACCEPT OPCAO.

    EVALUATE OPCAO
        WHEN 1
            PERFORM VER-SALDO
        WHEN 2
            PERFORM DEPOSITAR
        WHEN 3
            PERFORM SACAR
        WHEN 4
            PERFORM VER-DADOS
        WHEN 5
            CONTINUE
        WHEN OTHER
            DISPLAY "OPCAO INVALIDA"
    END-EVALUATE.

    EXIT.

VER-SALDO.
    DISPLAY "SALDO ATUAL: " SALDO.
    EXIT.

DEPOSITAR.
    DISPLAY "VALOR PARA DEPOSITO:".
    ACCEPT VALOR.
    ADD VALOR TO SALDO.
    DISPLAY "DEPOSITO REALIZADO".
    EXIT.

SACAR.
    DISPLAY "VALOR PARA SAQUE:".
    ACCEPT VALOR.
    IF VALOR > SALDO
        DISPLAY "SALDO INSUFICIENTE"
    ELSE
        SUBTRACT VALOR FROM SALDO
        DISPLAY "SAQUE REALIZADO"
    END-IF.
    EXIT.

VER-DADOS.
    DISPLAY "CONTA: " CONTA.
    DISPLAY "CLIENTE: " NOME.
    DISPLAY "SALDO: " SALDO.
    EXIT.